[net]
# Testing
# batch=1
# subdivisions=1
# Training
batch=64
subdivisions=1
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches = 200000
policy=steps
steps=160000,180000
scales=.1,.1


[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

##################### p3 64*64*128 (6)
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

##################### p4 32*32*256 (8)
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=1

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=relu

###########
##################### p5 16*16*256 (13)
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2

##################### p4_1 32*32*384 (16)
[route]
layers = -1, 8

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2

##################### p3_f 64*64*256 (19)
[route]
layers = -1, 6

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear



[yolo]
mask = 0,1,2
anchors = 8, 20,  23, 50,  38, 104,  92, 111,  58, 204,  109, 265,  286, 124,  185, 316,  334, 345
classes=1
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1

[route]
layers = -3

##################### p3_3 32*32*128 (24)
[maxpool] 
size=2
stride=2

##################### p4_f 32*32*512 (25)
[route]
layers = -1, 17, 8

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear



[yolo]
mask = 3,4,5
anchors = 8, 20,  23, 50,  38, 104,  92, 111,  58, 204,  109, 265,  286, 124,  185, 316,  334, 345
classes=1
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1

[route]
layers = -3

##################### p4_3 16*16*256 (30)
[maxpool] 
size=2
stride=2

##################### p5_f 16*16*512 (31)
[route]
layers = -1, 13

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=relu

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear



[yolo]
mask = 6,7,8
anchors = 8, 20,  23, 50,  38, 104,  92, 111,  58, 204,  109, 265,  286, 124,  185, 316,  334, 345
classes=1
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
